var searchData=
[
  ['1_20інкапсуляція_0',['1. Інкапсуляція',['../index.html#autotoc_md2',1,'']]],
  ['1_20моделі_20та_20їх_20опис_1',['1. Моделі та їх опис',['../index.html#autotoc_md15',1,'']]],
  ['10_20зменшення_20зв_20язності_20та_20покращення_20когезії_2',['10. Зменшення зв&apos;язності та покращення когезії',['../index.html#autotoc_md11',1,'']]],
  ['11_20принцип_20найменшого_20здивування_20law_20of_20demeter_3',['11. Принцип найменшого здивування (Law of Demeter)',['../index.html#autotoc_md12',1,'']]],
  ['12_20yagni_20you_20aren_20t_20gonna_20need_20it_4',['12. YAGNI (You Aren&apos;t Gonna Need It)',['../index.html#autotoc_md13',1,'']]]
];
